---
kind: type
id: T:Autodesk.Revit.DB.Structure.LoadCombinationType
source: html/cd4f9fcf-2a5c-b887-4b1f-426df941dcf4.htm
---
# Autodesk.Revit.DB.Structure.LoadCombinationType

Specifies load combination type.

## Syntax (C#)
```csharp
public enum LoadCombinationType
```